cleanli2/stm32/src/common.c
  RCC_APB2PeriphClockCmd(BEEP_GPIO_PERIPH, ENABLE);

  GPIO_InitStructure.GPIO_Pin = BEEP_GPIO_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(BEEP_GPIO_GROUP, &GPIO_InitStructure);
  GPIO_ResetBits(BEEP_GPIO_GROUP, BEEP_GPIO_PIN);
#endif
  //led end

  //power off pin set low
  RCC_APB2PeriphClockCmd(POWEROFF_GPIO_PERIPH, ENABLE);

  GPIO_InitStructure.GPIO_Pin = POWEROFF_GPIO_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(POWEROFF_GPIO_GROUP, &GPIO_InitStructure);
  GPIO_ResetBits(POWEROFF_GPIO_GROUP, POWEROFF_GPIO_PIN);
  //power off pin end

  RCC_GetClocksFreq(&RCC_ClocksStatus);
  get_mcu_id();
  lprintf_time("Version %s%s\n", VERSION, GIT_SHA1);

  lprintf("clk %d %d %d %d %d Hz\n\r",
		  RCC_ClocksStatus.SYSCLK_Frequency,
		  RCC_ClocksStatus.HCLK_Frequency,
		  RCC_ClocksStatus.PCLK1_Frequency,
		  RCC_ClocksStatus.PCLK2_Frequency,
		  RCC_ClocksStatus.ADCCLK_Frequency);
  lprintf_time("SD init\n");
  lprintf_time("SD init done\n");
  lprintf_time("lcd init\n");
  //lprintf_time("NO lcd init.\n");
  //SD_LowLevel_Init();

  /*1us/timer_count, 10ms/timer_intrpt*/
  g_cam_r70p_e = get_env_uint("camr70pe", 0);
  g_cam_r71p_e = get_env_uint("camr71pe", 0);
  g_tlcd = get_env_uint("cam2lcd", 0);
  while (looptimes--)
  {
      led_flash(0x3, 100);
  }
  beep_by_timer_100(0);
  if(con_is_recved())run_cmd_interface();
#if 0
    while(1){
        run_cmd_interface();
    }
  os_task_add(os_task_log, task_log_stack, "log", STACK_SIZE_LOCAL, 5);
  os_task_add(os_task1, task1_stack, "t1", STACK_SIZE_LOCAL, 1);
  os_task_add(os_task2, task2_stack, "t2", STACK_SIZE_LARGE*2, 2);
  os_task_add(os_task3, cmd_stack, "cmd", STACK_SIZE_LARGE, 4);
  os_task_add(os_touch, touch_stack, "touch", STACK_SIZE_LARGE, 2);
  os_task_add(os_task_display, display_stack, "display", STACK_SIZE_LARGE*2, 7);
  os_task_add(task_music, music_stack, "music", STACK_SIZE_LARGE, 6);
  os_task_add(os_ui, ui_stack, "ui", STACK_SIZE_LOCAL*2, 3);
  while(1){
  }
#endif
}

#if 0
DECLARE_OS_LOCK(oslktest, 3);
void os_lock_test()
{
    lprintf("task %s wait lock\n", cur_os_task->name);
    os_lock(&oslktest);
    lprintf("task %s in\n", cur_os_task->name);
    os_10ms_delay(200);
    lprintf("task %s out\n", cur_os_task->name);
    os_unlock(&oslktest);
    lprintf("task %s release lock\n", cur_os_task->name);
}
#endif

void os_task1(void*p)
{
    int td = 0;
    u32 direct = 1;
    (void)p;
    while(1){
        //mem_print(cur_os_task, cur_os_task, sizeof(os_task_st));
        os_10ms_delay(td/2);
        //putchars("1 1\n");
        //GPIO_SetBits(LED0_GPIO_GROUP,LED0_GPIO_PIN);
        os_10ms_delay(20-td/2+1);
        //putchars("1 0\n");
        //GPIO_ResetBits(LED0_GPIO_GROUP,LED0_GPIO_PIN);
#if 1
        if(direct){
            td++;
            if(td>=40){
                direct = 0;
            }
        }
        if(!direct){
            td--;
            if(td<=0){
                direct = 1;
            }
        }
#endif
    }
}
void os_task3(void*p)
{
    (void)p;
    while(1){
        run_cmd_interface();
    }
}
void os_task2(void*p)
{
    (void)p;
    while(1){
#if 0
        //mem_print(cur_os_task, cur_os_task, sizeof(os_task_st));
        //putchars("--0 0\n");
        GPIO_ResetBits(LED1_GPIO_GROUP,LED1_GPIO_PIN);
        os_10ms_delay(teset_td);
        //putchars("--0 1\n");
        GPIO_SetBits(LED1_GPIO_GROUP,LED1_GPIO_PIN);
        os_10ms_delay(teset_td);
        //lprintf("other task %d\n", *rtet);
#if 0
            {
                struct point pt_cache;
                os_lock(&oslk_evt);
                evt *dtw=RB_W_GET_wait(evt, rb_evt);
                //do work
                dtw->type = EVT_SCRN_TOUCH_UP;
                pt_cache.px=220;
                pt_cache.py=310;
                memcpy(dtw->pkg, &pt_cache, sizeof(struct point));
                RB_W_SET(evt, rb_evt);
                os_unlock(&oslk_evt);
            }
#endif
        task_timer(NULL);
#endif
    }
}
void soft_reset_system()
{
    lprintf_time("system reset\n");
    NVIC_SystemReset();
}

void reboot_download()
{
    lprintf_time("reboot download\n");
    GPIO_SetBits(GPIOA,GPIO_Pin_13);
    beep(100, 500);
    lprintf_time("reboot download\n");
    foce_save_log_func();
    soft_reset_system();
}

#ifdef  USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  lprintf("Wrong parameters value: file %s on line %d\r\n", file, line);
  /* Infinite loop */
  while (1)
  {
  }
}

#endif

/************************util***********************/
uint add_with_limit(uint a, uint b, uint limit)
{
    uint ret = a + b;
    if(ret >= limit){
        ret -= limit;
    }
    return ret;
}
uint sub_with_limit(uint a, uint b, uint limit)
{
    uint ret;
    if(a>=b){
        ret = a-b;
    }
    else{
        ret = a+limit-b;
    }
    return ret;
}
